                         # Задача 1 Арифметика
# '1st program'
print((9**0.5) * 5)
# второй вариант записи
print(9 ** 0.5 * 5)

                         #Задача 2 Логика
# '2nd program'
print(9.99 != 9.98) and (1000 != 1000.1)

                         #Задача 3 Школьная загадка
# '3rd program
print(2+2*2)
print(2*(2+2))
print(2+2*2==2*(2+2))
#другой варинат сравнения
print(2+2*2>2*(2+2))
print(2+2*2>=2*(2+2))

                        #Задача 4 Первый после точки
     # мне не до конца понятны к сожалению условия поэтому пишу код так как понял задачу
#4th program
print(type(float('123.456')))
print(type(123.456))
print(123.456*10)
print(int(123.456*10))
# дальше мне не понятно на этом задача закончена? (вывести 4 после запятой в состав целого числа)
# или в ответе должно остаться число 4?
             #если в ответе должно остаться число 4 тогда:
print(1234.56-4)
print(1234.56 - (1234.56-4))
print(int(1234.56 - (1234.56-4)))

print(int(float('123.456')*10)%10)